In [1]:
%%writefile sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Writing sea_rain1.csv

In [6]:
import pandas as pd

In [7]:
pd.read_csv("sea_rain1.csv")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [8]:
df1= pd.read_csv("sea_rain1.csv")

In [9]:
type(df1)

pandas.core.frame.DataFrame

In [10]:
df1[0:3]

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044

In [11]:
df1[0:3]["동해"]

0    17.4629
1    17.4116
2    17.5944
Name: 동해, dtype: float64

In [12]:
df1[0:3]["전체"]

0    15.9067
1    16.1526
2    16.6044
Name: 전체, dtype: float64

In [13]:
df1.columns

Index(['연도', '동해', '남해', '서해', '전체'], dtype='object')

In [14]:
df1.sum(axis=0)

연도    9990.0000
동해      88.5472
남해      89.1431
서해      74.4603
전체      81.9099
dtype: float64

In [18]:
df2 = df1[['동해', '남해', '서해', '전체']] # 연도를 제외하고 필요한 데이터들만 가져오기

In [19]:
df2

        동해       남해       서해       전체
0  17.4629  17.2288  14.4360  15.9067
1  17.4116  17.4092  14.8248  16.1526
2  17.5944  18.0110  15.2512  16.6044
3  18.1495  18.3175  14.8979  16.6284
4  17.9288  18.1766  15.0504  16.6178

In [20]:
df2.sum()

동해    88.5472
남해    89.1431
서해    74.4603
전체    81.9099
dtype: float64

In [21]:
df2.std()

동해    0.318000
남해    0.481937
서해    0.302738
전체    0.333283
dtype: float64

In [22]:
df2.describe()

             동해         남해         서해         전체
count   5.00000   5.000000   5.000000   5.000000
mean   17.70944  17.828620  14.892060  16.381980
std     0.31800   0.481937   0.302738   0.333283
min    17.41160  17.228800  14.436000  15.906700
25%    17.46290  17.409200  14.824800  16.152600
50%    17.59440  18.011000  14.897900  16.604400
75%    17.92880  18.176600  15.050400  16.617800
max    18.14950  18.317500  15.251200  16.628400

In [34]:
df3=pd.DataFrame(df2, columns=['동해', '남해', '서해', '전체']) # index를 columns으로 함

In [31]:
#df4=pd.DataFrame(df2, index=['1996','1997','1998','1999','2000'], columns=['동해', '남해', '서해', '전체'])

In [36]:
df3.loc[1:3] # location

        동해       남해       서해       전체
1  17.4116  17.4092  14.8248  16.1526
2  17.5944  18.0110  15.2512  16.6044
3  18.1495  18.3175  14.8979  16.6284

In [26]:
df3.columns

Index(['동해', '남해', '서해', '전체'], dtype='object')

In [40]:
#help(pd.read_csv)

In [41]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [46]:
df_WH.index.name='User' # User는 변수명이 아니라 인덱스 명

In [45]:
df_WH.columns

Index(['Weight', 'Height'], dtype='object')

In [47]:
df_WH['Weight']

User
ID_1    62
ID_2    67
ID_3    55
ID_4    74
Name: Weight, dtype: int64

In [50]:
bmi=df_WH['Weight']/(df_WH['Height']/100)**2

In [51]:
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [52]:
type(bmi)

pandas.core.series.Series

In [53]:
df_WH['BMI']=bmi

In [54]:
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [55]:
df_WH.to_csv("save_DF.csv") # CSV 파일로 저장하는 방

In [56]:
!type save_DF.csv

User,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [58]:
df_WH.to_csv("save_DF_txt.txt") # to_csv를 이용해 txt 파일로 저장